test/2D/lbmCavity/0/f_0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      f_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
444.444
444.444
444.444
444.444
444.444
444.444
444.444
444.444
...
)
;

boundaryField
{
    movingWall
    {
        type            lbmWall;
        index           0;
        value           nonuniform List<scalar> 
200
(
436.925
437.741
437.823
437.798
437.782
437.778
437.778
437.778
...
)
;
    }
    boundaryWall
    {
        type            lbmWall;
        index           0;
        value           nonuniform List<scalar> 
600
(
444.444
444.444
444.444
444.444
444.444
444.444
444.444
444.444
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
