test/2D/lbmCavity/0/f_1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      f_1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
111.111
111.111
111.111
111.111
111.111
111.111
111.111
111.111
...
)
;

boundaryField
{
    movingWall
    {
        type            lbmWall;
        index           1;
        value           nonuniform List<scalar> 
200
(
147.425
147.678
147.768
147.785
147.783
147.779
147.778
147.778
...
)
;
    }
    boundaryWall
    {
        type            lbmWall;
        index           1;
        value           nonuniform List<scalar> 
600
(
111.111
111.111
111.111
111.111
111.111
111.111
111.111
111.111
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
