test/2D/lbmCavity/0/f_2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      f_2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
111.111
111.111
111.111
111.111
111.111
111.111
111.111
111.111
...
)
;

boundaryField
{
    movingWall
    {
        type            lbmWall;
        index           2;
        value           nonuniform List<scalar> 
200
(
109.891
110.056
110.075
110.071
110.068
110.067
110.067
110.067
...
)
;
    }
    boundaryWall
    {
        type            lbmWall;
        index           2;
        value           nonuniform List<scalar> 
600
(
111.111
111.111
111.111
111.111
111.111
111.111
111.111
111.111
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
