test/2D/lbmCavity/0/f_3
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      f_3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
111.111
111.111
111.111
111.111
111.111
111.111
111.111
111.111
...
)
;

boundaryField
{
    movingWall
    {
        type            lbmWall;
        index           3;
        value           nonuniform List<scalar> 
200
(
81.0894
81.1286
81.1128
81.1111
81.1109
81.111
81.1111
81.1111
...
)
;
    }
    boundaryWall
    {
        type            lbmWall;
        index           3;
        value           nonuniform List<scalar> 
600
(
111.111
111.111
111.111
111.111
111.111
111.111
111.111
111.111
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
