test/2D/lbmCavity/0/f_6
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      f_6;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
...
)
;

boundaryField
{
    movingWall
    {
        type            lbmWall;
        index           6;
        value           nonuniform List<scalar> 
200
(
23.0675
23.0818
23.0791
23.0785
23.0783
23.0783
23.0783
23.0783
...
)
;
    }
    boundaryWall
    {
        type            lbmWall;
        index           6;
        value           nonuniform List<scalar> 
600
(
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
