test/2D/lbmCavity/0/f_7
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      f_7;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
...
)
;

boundaryField
{
    movingWall
    {
        type            lbmWall;
        index           7;
        value           nonuniform List<scalar> 
200
(
15.7641
16.7658
16.9135
16.8861
16.8622
16.855
16.8543
16.8546
...
)
;
    }
    boundaryWall
    {
        type            lbmWall;
        index           7;
        value           nonuniform List<scalar> 
600
(
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
