test/2D/lbmCavity/0/f_8
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      f_8;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
...
)
;

boundaryField
{
    movingWall
    {
        type            lbmWall;
        index           8;
        value           nonuniform List<scalar> 
200
(
39.6614
39.7453
39.7496
39.7469
39.7454
39.745
39.745
39.745
...
)
;
    }
    boundaryWall
    {
        type            lbmWall;
        index           8;
        value           nonuniform List<scalar> 
600
(
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
27.7778
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
