test/2D/lbmCavity/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
100000
100000
100000
100000
100000
100000
100000
100000
...
)
;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
99869.1
99989.4
100006
100003
100001
100000
100000
100000
...
)
;
    }
    boundaryWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
600
(
100000
100000
100000
100000
100000
100000
100000
100000
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
