test/2D/lbmCavity/constant/velocitySetData
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      velocitySetData;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dirNum          9;

lICS2           3;

MCD             36;

wNum_0          16;

wNum_1          4;

wNum_2          4;

wNum_3          4;

wNum_4          4;

wNum_5          1;

wNum_6          1;

wNum_7          1;

wNum_8          1;

lattVect_0      ( 0 0 0 );

lattVect_1      ( 1 0 0 );

lattVect_2      ( 0 0 1 );

lattVect_3      ( -1 0 0 );

lattVect_4      ( 0 0 -1 );

lattVect_5      ( 1 0 1 );

lattVect_6      ( -1 0 1 );

lattVect_7      ( -1 0 -1 );

lattVect_8      ( 1 0 -1 );

inKey
{
    "0"             0;
    "1"             3;
    "2"             4;
    "3"             1;
    "4"             2;
    "5"             7;
    "6"             8;
    "7"             5;
    "8"             6;
}

c
{
    value           10;
}


// ************************************************************************* //
