test/2D/lbmCavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
     (-1   0  -1)
     ( 1   0  -1)
     ( 1   1  -1)
     (-1   1  -1)
     (-1   0   1)
     ( 1   0   1)
     ( 1   1   1)
     (-1   1   1)
);

blocks
(
     hex (0 1 2 3 4 5 6 7)   (200 1 200) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
  movingWall
  {
    type wall;
    faces
    (
      (4 5 6 7)
    );
  }

  boundaryWall
  {
    type wall;
    faces
    (
      (1 2 5 6)
      (0 3 7 4)
      (0 1 2 3)
    );
  }

  frontAndBack
  {
    type empty;
    faces
    (
      (3 2 6 7)
      (0 1 5 4)
    );
  }
);

mergePatchPairs
(
);

// ************************************************************************* //
