test/2D/lbmCavity/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "f.*"
    {
        solver           PBiCG;
        preconditioner   DILU;
        smoother         DIC;

        tolerance       1e-15;
        relTol          1e-3;
        maxIter         100;
    }

	"(f.*)Final"
	{
		$("f.*");
    solver           PBiCG;
    preconditioner   DILU
    smoother         DIC;

    tolerance       1e-15;
    relTol          1e-3;
    maxIter         100;
	}

}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors         3;

    residualControl
    {
      "f.*"             1e-5;
    }
}




// ************************************************************************* //
